zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_IERB.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_NETC_IERB.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_NETC_IERB
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_NETC_IERB_H_)  /* Check if memory map has not been already included */
#define S32K566_NETC_IERB_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- NETC_IERB Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NETC_IERB_Peripheral_Access_Layer NETC_IERB Peripheral Access Layer
 * @{
 */

/** NETC_IERB - Size of Registers Arrays */
#define NETC_IERB_HTA_NUM_COUNT                   1u
#define NETC_IERB_ARRAY_NUM_RC_COUNT              1u
#define NETC_IERB_EMDIO_PF_BOOT_LOAD_COUNT        2u
#define NETC_IERB_NUM_TMR_ARRAY_TMR_PF_BOOT_LOAD_COUNT 2u
#define NETC_IERB_NUM_TMR_ARRAY_COUNT             1u
#define NETC_IERB_CFG_SW_INST_SW_PF_BOOT_LOAD_COUNT 2u
#define NETC_IERB_CFG_SW_INST_COUNT               1u
#define NETC_IERB_CFG_ENETC_INST_ENETC_PF_BOOT_LOAD_COUNT 2u
#define NETC_IERB_CFG_ENETC_INST_COUNT            1u
#define NETC_IERB_CFG_VSI_INST_VSI_PF_BOOT_LOAD_COUNT 2u
#define NETC_IERB_CFG_VSI_INST_COUNT              5u

/** NETC_IERB - Register Layout Typedef */
typedef struct NETC_IERB_Struct {
  __I  uint32_t CAPR0;                             /**< Capability Register 0, offset: 0x0 */
  __I  uint32_t CAPR1;                             /**< Capability Register 1, offset: 0x4 */
  __I  uint32_t CAPR2;                             /**< Capability Register 2, offset: 0x8 */
  __I  uint32_t CAPR3;                             /**< Capability Register 3, offset: 0xC */
  uint8_t RESERVED_0[16];
  __I  uint32_t CMCAPR;                            /**< Common Memory Capability Register, offset: 0x20 */
  uint8_t RESERVED_1[12];
  __I  uint32_t ITTMCAPR;                          /**< Ingress Ternary Table Memory Capability Register, offset: 0x30 */
  uint8_t RESERVED_2[76];
  __IO uint32_t SMDTR;                             /**< Shared memory depletion threshold register, offset: 0x80 */
  __IO uint32_t ERSMBAR;                           /**< ENETC receive shared memory buffer allotment register, offset: 0x84 */
  uint8_t RESERVED_3[56];
  struct NETC_IERB_HTA_NUM {                       /* offset: 0xC0, array step: 0x8 */
    __IO uint32_t HTAHPCR;                           /**< HTA 0 HP configuration register, array offset: 0xC0, array step: 0x8 */
    __IO uint32_t HTALPCR;                           /**< HTA 0 LP configuration register, array offset: 0xC4, array step: 0x8 */
  } HTA_NUM[NETC_IERB_HTA_NUM_COUNT];
  uint8_t RESERVED_4[56];
  __IO uint32_t HBTMAR;                            /**< Hash bucket table memory allocation register, offset: 0x100 */
  __IO uint32_t HBTCR;                             /**< Hash Bucket Table Configuration Register, offset: 0x104 */
  __I  uint32_t GHTEMCAPR;                         /**< Guaranteed hash table entry memory capability register, offset: 0x108 */
  uint8_t RESERVED_5[36];
  __IO uint32_t ITTCR;                             /**< Ingress ternary table configuration register, offset: 0x130 */
  uint8_t RESERVED_6[60];
  __IO uint32_t NETCFLRCR;                         /**< NETC FLR configuration register, offset: 0x170 */
  uint8_t RESERVED_7[4];
  __IO uint32_t NETCCLKFR;                         /**< NETC clock period fractional register, offset: 0x178 */
  __IO uint32_t NETCCLKCR;                         /**< NETC clock configuration register, offset: 0x17C */
  __IO uint32_t SBCR;                              /**< System bus configuration register, offset: 0x180 */
  __IO uint32_t SBOTCR;                            /**< System bus outstanding transaction control register, offset: 0x184 */
  uint8_t RESERVED_8[8];
  __IO uint32_t SGLTTR;                            /**< Stream gating lag time for timestamp refresh register, offset: 0x190 */
  uint8_t RESERVED_9[108];
  struct NETC_IERB_ARRAY_NUM_RC {                  /* offset: 0x200, array step: 0x10 */
    uint8_t RESERVED_0[8];
    __IO uint32_t RCMSICAR;                          /**< Root complex 0 MSI-X cache attribute register, array offset: 0x208, array step: 0x10 */
    __IO uint32_t RCMSIAMQR;                         /**< Root complex 0 MSI access management qualifier register, array offset: 0x20C, array step: 0x10 */
  } ARRAY_NUM_RC[NETC_IERB_ARRAY_NUM_RC_COUNT];
  uint8_t RESERVED_10[260];
  __I  uint32_t EMDIOMCR;                          /**< EMDIO MSI-X configuration register, offset: 0x314 */
  uint8_t RESERVED_11[8];
  __IO uint32_t EMDIO_CFH_DIDVID;                  /**< EMDIO config header device ID and vendor ID register, offset: 0x320 */
  __IO uint32_t EMDIO_CFH_SIDSVID;                 /**< EMDIO config header subsystem ID and subsystem vendor ID register, offset: 0x324 */
  uint8_t RESERVED_12[28];
  __IO uint32_t EMDIOFAUXR;                        /**< EMDIO function auxiliary register, offset: 0x344 */
  __IO uint32_t EMDIOBLPR[NETC_IERB_EMDIO_PF_BOOT_LOAD_COUNT]; /**< EMDIO boot loader parameter register 0..EMDIO boot loader parameter register 1, array offset: 0x348, array step: 0x4 */
  __IO uint32_t EMDIO_CFG;                         /**< EMDIO configuration register, offset: 0x350 */
  uint8_t RESERVED_13[12];
  __IO uint32_t EMDIORIDAR;                        /**< EMDIO RID assignment register, offset: 0x360 */
  uint8_t RESERVED_14[156];
  struct NETC_IERB_NUM_TMR_ARRAY {                 /* offset: 0x400, array step: 0x64 */
    uint8_t RESERVED_0[20];
    __IO uint32_t TMCR;                              /**< Timer 0 MSI-X configuration register, array offset: 0x414, array step: 0x64 */
    uint8_t RESERVED_1[8];
    __IO uint32_t T_CFH_DIDVID;                      /**< Timer 0 config header device ID and vendor ID register, array offset: 0x420, array step: 0x64 */
    __IO uint32_t T_CFH_SIDSVID;                     /**< Timer 0 config header subsystem ID and subsystem vendor ID register, array offset: 0x424, array step: 0x64 */
    uint8_t RESERVED_2[28];
    __IO uint32_t TFAUXR;                            /**< Timer 0 function auxiliary register, array offset: 0x444, array step: 0x64 */
    __IO uint32_t TBLPR[NETC_IERB_NUM_TMR_ARRAY_TMR_PF_BOOT_LOAD_COUNT];   /**< Timer 0 boot loader parameter register 0..Timer 0 boot loader parameter register 1, array offset: 0x448, array step: index*0x64, index2*0x4 */
    uint8_t RESERVED_3[16];
    __IO uint32_t TRIDAR;                            /**< Timer 0 RID assignment register, array offset: 0x460, array step: 0x64 */
  } NUM_TMR_ARRAY[NETC_IERB_NUM_TMR_ARRAY_COUNT];
  uint8_t RESERVED_15[432];
  __IO uint32_t TM0MCR;                            /**< Timer media channel 0 MSI-X configuration register, offset: 0x614 */
  uint8_t RESERVED_16[8];
  __IO uint32_t TM_CFH_DIDVID;                     /**< Timer media channel config header device ID and vendor ID register, offset: 0x620 */
  __IO uint32_t TM_CFH_SIDSVID;                    /**< Timer media channel config header subsystem ID and subsystem vendor ID register, offset: 0x624 */
  uint8_t RESERVED_17[8];
  __IO uint32_t TM0CAR;                            /**< Timer media channel 0 cache attribute register, offset: 0x630 */
  uint8_t RESERVED_18[12];
  __IO uint32_t TM0AMQR;                           /**< Timer media channel 0 access management qualifier register, offset: 0x640 */
  __IO uint32_t TM0FAUXR;                          /**< Timer media channel 0 function auxiliary register, offset: 0x644 */
  uint8_t RESERVED_19[24];
  __IO uint32_t TM0RIDAR;                          /**< Timer media channel 0 RID assignment register, offset: 0x660 */
  uint8_t RESERVED_20[412];
  __I  uint32_t TGSMCAPR;                          /**< Time gate scheduling memory capability register, offset: 0x800 */
  __I  uint32_t TGSM0MAPR;                         /**< Time gate scheduling memory 0 mapping register, offset: 0x804 */
  __I  uint32_t TGSM0CAPR;                         /**< Time gate scheduling memory 0 capability register, offset: 0x808 */
  __IO uint32_t GM0ATCAPR;                         /**< Gate manager 0 advance time capability register, offset: 0x80C */
  uint8_t RESERVED_21[2032];
  __I  uint32_t L0CAPR;                            /**< Link 0 capability register, offset: 0x1000 */
  __I  uint32_t L0MCAPR;                           /**< Link 0 MAC capability register, offset: 0x1004 */
  __I  uint32_t L0IOCAPR;                          /**< Link 0 I/O capability register, offset: 0x1008 */
  uint8_t RESERVED_22[4];
  __IO uint32_t L0BCR;                             /**< Link 0 binding configuration register, offset: 0x1010 */
  __IO uint32_t L0TXBCCTR;                         /**< Link 0 transmit byte credit comfort threshold register, offset: 0x1014 */
  uint8_t RESERVED_23[8];
  __IO uint32_t L0E0MAR0;                          /**< Link 0 end 0 MAC address register 0, offset: 0x1020 */
  __IO uint32_t L0E0MAR1;                          /**< Link 0 end 0 MAC address register 1, offset: 0x1024 */
  uint8_t RESERVED_24[24];
  __I  uint32_t L1CAPR;                            /**< Link 1 capability register, offset: 0x1040 */
  __I  uint32_t L1MCAPR;                           /**< Link 1 MAC capability register, offset: 0x1044 */
  __I  uint32_t L1IOCAPR;                          /**< Link 1 I/O capability register, offset: 0x1048 */
  uint8_t RESERVED_25[4];
  __IO uint32_t L1BCR;                             /**< Link 1 binding configuration register, offset: 0x1050 */
  __IO uint32_t L1TXBCCTR;                         /**< Link 1 transmit byte credit comfort threshold register, offset: 0x1054 */
  uint8_t RESERVED_26[8];
  __IO uint32_t L1E0MAR0;                          /**< Link 1 end 0 MAC address register 0, offset: 0x1060 */
  __IO uint32_t L1E0MAR1;                          /**< Link 1 end 0 MAC address register 1, offset: 0x1064 */
  uint8_t RESERVED_27[24];
  __I  uint32_t L2CAPR;                            /**< Link 2 capability register, offset: 0x1080 */
  __I  uint32_t L2MCAPR;                           /**< Link 2 MAC capability register, offset: 0x1084 */
  __I  uint32_t L2IOCAPR;                          /**< Link 2 I/O capability register, offset: 0x1088 */
  uint8_t RESERVED_28[4];
  __IO uint32_t L2BCR;                             /**< Link 2 binding configuration register, offset: 0x1090 */
  __IO uint32_t L2TXBCCTR;                         /**< Link 2 transmit byte credit comfort threshold register, offset: 0x1094 */
  uint8_t RESERVED_29[8];
  __IO uint32_t L2E0MAR0;                          /**< Link 2 end 0 MAC address register 0, offset: 0x10A0 */
  __IO uint32_t L2E0MAR1;                          /**< Link 2 end 0 MAC address register 1, offset: 0x10A4 */
  uint8_t RESERVED_30[24];
  __I  uint32_t L3CAPR;                            /**< Link 3 capability register, offset: 0x10C0 */
  __I  uint32_t L3MCAPR;                           /**< Link 3 MAC capability register, offset: 0x10C4 */
  __I  uint32_t L3IOCAPR;                          /**< Link 3 I/O capability register, offset: 0x10C8 */
  uint8_t RESERVED_31[4];
  __IO uint32_t L3BCR;                             /**< Link 3 binding configuration register, offset: 0x10D0 */
  __IO uint32_t L3TXBCCTR;                         /**< Link 3 transmit byte credit comfort threshold register, offset: 0x10D4 */
  uint8_t RESERVED_32[8];
  __IO uint32_t L3E0MAR0;                          /**< Link 3 end 0 MAC address register 0, offset: 0x10E0 */
  __IO uint32_t L3E0MAR1;                          /**< Link 3 end 0 MAC address register 1, offset: 0x10E4 */
  uint8_t RESERVED_33[24];
  __I  uint32_t L4CAPR;                            /**< Link 4 capability register, offset: 0x1100 */
  __I  uint32_t L4MCAPR;                           /**< Link 4 MAC capability register, offset: 0x1104 */
  __I  uint32_t L4IOCAPR;                          /**< Link 4 I/O capability register, offset: 0x1108 */
  uint8_t RESERVED_34[4];
  __IO uint32_t L4BCR;                             /**< Link 4 binding configuration register, offset: 0x1110 */
  __IO uint32_t L4TXBCCTR;                         /**< Link 4 transmit byte credit comfort threshold register, offset: 0x1114 */
  uint8_t RESERVED_35[8];
  __IO uint32_t L4E0MAR0;                          /**< Link 4 end 0 MAC address register 0, offset: 0x1120 */
  __IO uint32_t L4E0MAR1;                          /**< Link 4 end 0 MAC address register 1, offset: 0x1124 */
  uint8_t RESERVED_36[24];
  __I  uint32_t L5CAPR;                            /**< Link 5 capability register, offset: 0x1140 */
  __I  uint32_t L5MCAPR;                           /**< Link 5 MAC capability register, offset: 0x1144 */
  uint8_t RESERVED_37[8];
  __I  uint32_t L5BCR;                             /**< Link 5 binding configuration register, offset: 0x1150 */
  __IO uint32_t L5TXBCCTR;                         /**< Link 5 transmit byte credit comfort threshold register, offset: 0x1154 */
  uint8_t RESERVED_38[8];
  __IO uint32_t L5E0MAR0;                          /**< Link 5 end 0 MAC address register 0, offset: 0x1160 */
  __IO uint32_t L5E0MAR1;                          /**< Link 5 end 0 MAC address register 1, offset: 0x1164 */
  __IO uint32_t L5E1MAR0;                          /**< Link 5 end 1 MAC address register 0, offset: 0x1168 */
  __IO uint32_t L5E1MAR1;                          /**< Link 5 end 1 MAC address register 1, offset: 0x116C */
  uint8_t RESERVED_39[3728];
  struct NETC_IERB_CFG_SW_INST {                   /* offset: 0x2000, array step: 0x21C */
    uint8_t RESERVED_0[20];
    __IO uint32_t SMCR;                              /**< Switch 0 MSI-X configuration register, array offset: 0x2014, array step: 0x21C */
    __I  uint32_t SEVMCR;                            /**< Switch 0 event monitor configuration register, array offset: 0x2018, array step: 0x21C */
    uint8_t RESERVED_1[4];
    __IO uint32_t S_CFH_DIDVID;                      /**< Switch 0 config header device ID and vendor ID register, array offset: 0x2020, array step: 0x21C */
    __IO uint32_t S_CFH_SIDSVID;                     /**< Switch 0 config header subsystem ID and subsystem vendor ID register, array offset: 0x2024, array step: 0x21C */
    uint8_t RESERVED_2[16];
    __IO uint32_t SCCAR;                             /**< Switch 0 command cache attribute register, array offset: 0x2038, array step: 0x21C */
    uint8_t RESERVED_3[4];
    __IO uint32_t SAMQR;                             /**< Switch 0 access management qualifier register, array offset: 0x2040, array step: 0x21C */
    __IO uint32_t SFAUXR;                            /**< Switch 0 function auxiliary register, array offset: 0x2044, array step: 0x21C */
    __IO uint32_t SBLPR[NETC_IERB_CFG_SW_INST_SW_PF_BOOT_LOAD_COUNT];   /**< Switch 0 boot loader parameter register 0..Switch 0 boot loader parameter register 1, array offset: 0x2048, array step: index*0x21C, index2*0x4 */
    __IO uint32_t SRIDAR;                            /**< Switch 0 RID assignment register, array offset: 0x2050, array step: 0x21C */
    uint8_t RESERVED_4[12];
    __IO uint32_t SSMBAR;                            /**< Switch 0 shared memory buffer allotment register, array offset: 0x2060, array step: 0x21C */
    uint8_t RESERVED_5[28];
    __IO uint32_t SHTMAR;                            /**< Switch 0 hash table memory allotment register, array offset: 0x2080, array step: 0x21C */
    __IO uint32_t SITMAR;                            /**< Switch 0 index table memory allocation register, array offset: 0x2084, array step: 0x21C */
    __IO uint32_t SIPFTMAR;                          /**< Switch 0 ingress port filter table memory allocation register, array offset: 0x2088, array step: 0x21C */
    uint8_t RESERVED_6[20];
    __IO uint32_t SRPITMAR;                          /**< Switch 0 rate policer index table memory allocation register, array offset: 0x20A0, array step: 0x21C */
    __IO uint32_t SISCITMAR;                         /**< Switch 0 ingress stream counter index table memory allocation register, array offset: 0x20A4, array step: 0x21C */
    __IO uint32_t SISITMAR;                          /**< Switch 0 ingress stream index table memory allocation register, array offset: 0x20A8, array step: 0x21C */
    __IO uint32_t SISQGITMAR;                        /**< Switch 0 ingress sequence generation index table memory allocation register, array offset: 0x20AC, array step: 0x21C */
    uint8_t RESERVED_7[4];
    __IO uint32_t SSGIITMAR;                         /**< Switch 0 stream gate instance index table memory allocation register, array offset: 0x20B4, array step: 0x21C */
    __IO uint32_t SSGCLITMAR;                        /**< Switch 0 stream gate control list index table memory allocation register, array offset: 0x20B8, array step: 0x21C */
    __IO uint32_t SFMITMAR;                          /**< Switch 0 frame modification index table memory allocation register, array offset: 0x20BC, array step: 0x21C */
    __IO uint32_t SFMDITMAR;                         /**< Switch 0 frame modification data index table memory allocation register, array offset: 0x20C0, array step: 0x21C */
    uint8_t RESERVED_8[4];
    __IO uint32_t SASIITMAR;                         /**< Switch 0 ATS scheduler instance index table memory allocation register, array offset: 0x20C8, array step: 0x21C */
    uint8_t RESERVED_9[36];
    __IO uint32_t STGSTAR;                           /**< Switch 0 time gate scheduling table allocation register, array offset: 0x20F0, array step: 0x21C */
    __IO uint32_t STGSLR;                            /**< Switch 0 time gate scheduling lookahead register, array offset: 0x20F4, array step: 0x21C */
    uint8_t RESERVED_10[268];
    __I  uint32_t SMPCR;                             /**< Switch 0 management port configuration register, array offset: 0x2204, array step: 0x21C */
    uint8_t RESERVED_11[8];
    __IO uint32_t SVFHTDECR0;                        /**< Switch 0 VLAN Filter (hash) table default entry configuration registers 0, array offset: 0x2210, array step: 0x21C */
    __IO uint32_t SVFHTDECR1;                        /**< Switch 0 VLAN filter hash table default entry configuration registers 1, array offset: 0x2214, array step: 0x21C */
    __IO uint32_t SVFHTDECR2;                        /**< Switch 0 VLAN filter hash table default entry configuration registers 2, array offset: 0x2218, array step: 0x21C */
  } CFG_SW_INST[NETC_IERB_CFG_SW_INST_COUNT];
  uint8_t RESERVED_40[3556];
  struct NETC_IERB_CFG_ENETC_INST {                /* offset: 0x3000, array step: 0xF8 */
    uint8_t RESERVED_0[4];
    __I  uint32_t EBCR1;                             /**< ENETC 0 binding configuration register 1, array offset: 0x3004, array step: 0xF8 */
    __I  uint32_t EBCR2;                             /**< ENETC 0 binding configuration register 2, array offset: 0x3008, array step: 0xF8 */
    uint8_t RESERVED_1[4];
    __IO uint32_t EVFRIDAR;                          /**< ENETC 0 VF RID assignment register, array offset: 0x3010, array step: 0xF8 */
    __IO uint32_t EMCR;                              /**< ENETC 0 MSI-X configuration register, array offset: 0x3014, array step: 0xF8 */
    __I  uint32_t EEVMCR;                            /**< ENETC 0 event monitor configuration register, array offset: 0x3018, array step: 0xF8 */
    uint8_t RESERVED_2[4];
    __IO uint32_t E_CFH_DIDVID;                      /**< ENETC 0 config header device ID and vendor ID register, array offset: 0x3020, array step: 0xF8 */
    __IO uint32_t E_CFH_SIDSVID;                     /**< ENETC 0 config header subsystem ID and subsystem vendor ID register, array offset: 0x3024, array step: 0xF8 */
    __IO uint32_t E_CFC_VFDID;                       /**< ENETC 0 config capability VF device ID register, array offset: 0x3028, array step: 0xF8 */
    uint8_t RESERVED_3[4];
    __IO uint32_t EBCAR;                             /**< ENETC 0 buffer cache attribute register 0, array offset: 0x3030, array step: 0xF8 */
    __IO uint32_t EMCAR;                             /**< ENETC 0 message cache attribute register, array offset: 0x3034, array step: 0xF8 */
    __IO uint32_t ECAR;                              /**< ENETC 0 command cache attribute register, array offset: 0x3038, array step: 0xF8 */
    uint8_t RESERVED_4[4];
    __IO uint32_t EAMQR;                             /**< ENETC 0 access management qualifier register, array offset: 0x3040, array step: 0xF8 */
    __IO uint32_t EFAUXR;                            /**< ENETC 0 function auxiliary register, array offset: 0x3044, array step: 0xF8 */
    __IO uint32_t EBLPR[NETC_IERB_CFG_ENETC_INST_ENETC_PF_BOOT_LOAD_COUNT];   /**< ENETC 0 boot loader parameter register 0..ENETC 0 boot loader parameter register 1, array offset: 0x3048, array step: index*0xF8, index2*0x4 */
    __IO uint32_t ERXMBER;                           /**< ENETC 0 receive memory buffer entitlement register, array offset: 0x3050, array step: 0xF8 */
    __IO uint32_t ERXMBLR;                           /**< ENETC 0 receive memory buffer limit register, array offset: 0x3054, array step: 0xF8 */
    uint8_t RESERVED_5[8];
    __IO uint32_t ERIDAR;                            /**< ENETC 0 RID assignment register, array offset: 0x3060, array step: 0xF8 */
    uint8_t RESERVED_6[12];
    __IO uint32_t ETXHPTBCR;                         /**< ENETC 0 transmit high priority tier byte credit register, array offset: 0x3070, array step: 0xF8 */
    __IO uint32_t ETXLPTBCR;                         /**< ENETC 0 transmit low priority tier byte credit register, array offset: 0x3074, array step: 0xF8 */
    uint8_t RESERVED_7[8];
    __IO uint32_t EHTMAR;                            /**< ENETC 0 hash table memory allotment register, array offset: 0x3080, array step: 0xF8 */
    __IO uint32_t EITMAR;                            /**< ENETC 0 index table memory allocation register, array offset: 0x3084, array step: 0xF8 */
    __IO uint32_t EIPFTMAR;                          /**< ENETC 0 ingress port filter table memory allocation register, array offset: 0x3088, array step: 0xF8 */
    uint8_t RESERVED_8[4];
