zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_IERB.h
    __I  uint32_t ERTMAR;                            /**< ENETC 0 RFS ternary memory allocation register, array offset: 0x3090, array step: 0xF8 */
    uint8_t RESERVED_9[12];
    __IO uint32_t ERPITMAR;                          /**< ENETC 0 rate policer index table memory allocation register, array offset: 0x30A0, array step: 0xF8 */
    __IO uint32_t EISCITMAR;                         /**< ENETC 0 ingress stream counter index table memory allocation register, array offset: 0x30A4, array step: 0xF8 */
    __IO uint32_t EISITMAR;                          /**< ENETC 0 ingress stream index table memory allocation register, array offset: 0x30A8, array step: 0xF8 */
    uint8_t RESERVED_10[8];
    __IO uint32_t ESGIITMAR;                         /**< ENETC 0 stream gate instance index table memory allocation register, array offset: 0x30B4, array step: 0xF8 */
    __IO uint32_t ESGCLITMAR;                        /**< ENETC 0 stream gate control list index table memory allocation register, array offset: 0x30B8, array step: 0xF8 */
    uint8_t RESERVED_11[52];
    __IO uint32_t ETGSTAR;                           /**< ENETC 0 time gate scheduling table allocation register, array offset: 0x30F0, array step: 0xF8 */
    __IO uint32_t ETGSLR;                            /**< ENETC 0 time gate scheduling lookahead register, array offset: 0x30F4, array step: 0xF8 */
  } CFG_ENETC_INST[NETC_IERB_CFG_ENETC_INST_COUNT];
  uint8_t RESERVED_41[3848];
  struct NETC_IERB_CFG_VSI_INST {                  /* offset: 0x4000, array step: 0x40 */
    __IO uint32_t VAMQR;                             /**< VSI 0 access management qualifier register..VSI 4 access management qualifier register, array offset: 0x4000, array step: 0x40 */
    __IO uint32_t VFAUXR;                            /**< VSI 0 function auxiliary register..VSI 4 function auxiliary register, array offset: 0x4004, array step: 0x40 */
    __IO uint32_t VBLPR[NETC_IERB_CFG_VSI_INST_VSI_PF_BOOT_LOAD_COUNT];   /**< VSI 0 boot loader parameter register 0..VSI 4 boot loader parameter register 1, array offset: 0x4008, array step: index*0x40, index2*0x4 */
    __IO uint32_t VPMAR0;                            /**< VSI 0 primary MAC address register 0..VSI 4 primary MAC address register 0, array offset: 0x4010, array step: 0x40 */
    __IO uint32_t VPMAR1;                            /**< VSI 0 primary MAC address register 1..VSI 4 primary MAC address register 1, array offset: 0x4014, array step: 0x40 */
    uint8_t RESERVED_0[40];
  } CFG_VSI_INST[NETC_IERB_CFG_VSI_INST_COUNT];
} NETC_IERB_Type, *NETC_IERB_MemMapPtr;

/** Number of instances of the NETC_IERB module. */
#define NETC_IERB_INSTANCE_COUNT                 (1u)

/* NETC_IERB - Peripheral instance base addresses */
/** Peripheral NETC__NETC_IERB base address */
#define IP_NETC__NETC_IERB_BASE                  (0x6D200000u)
/** Peripheral NETC__NETC_IERB base pointer */
#define IP_NETC__NETC_IERB                       ((NETC_IERB_Type *)IP_NETC__NETC_IERB_BASE)
/** Array initializer of NETC_IERB peripheral base addresses */
#define IP_NETC_IERB_BASE_ADDRS                  { IP_NETC__NETC_IERB_BASE }
/** Array initializer of NETC_IERB peripheral base pointers */
#define IP_NETC_IERB_BASE_PTRS                   { IP_NETC__NETC_IERB }

/* ----------------------------------------------------------------------------
   -- NETC_IERB Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NETC_IERB_Register_Masks NETC_IERB Register Masks
 * @{
 */

/*! @name CAPR0 - Capability Register 0 */
/*! @{ */

#define NETC_IERB_CAPR0_NUM_EMDIO_MASK           (0x10U)
#define NETC_IERB_CAPR0_NUM_EMDIO_SHIFT          (4U)
#define NETC_IERB_CAPR0_NUM_EMDIO_WIDTH          (1U)
#define NETC_IERB_CAPR0_NUM_EMDIO(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_CAPR0_NUM_EMDIO_SHIFT)) & NETC_IERB_CAPR0_NUM_EMDIO_MASK)

#define NETC_IERB_CAPR0_NUM_TMR_MASK             (0xC0U)
#define NETC_IERB_CAPR0_NUM_TMR_SHIFT            (6U)
#define NETC_IERB_CAPR0_NUM_TMR_WIDTH            (2U)
#define NETC_IERB_CAPR0_NUM_TMR(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_CAPR0_NUM_TMR_SHIFT)) & NETC_IERB_CAPR0_NUM_TMR_MASK)

#define NETC_IERB_CAPR0_NUM_LINKS_MASK           (0x1F00U)
#define NETC_IERB_CAPR0_NUM_LINKS_SHIFT          (8U)
#define NETC_IERB_CAPR0_NUM_LINKS_WIDTH          (5U)
#define NETC_IERB_CAPR0_NUM_LINKS(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_CAPR0_NUM_LINKS_SHIFT)) & NETC_IERB_CAPR0_NUM_LINKS_MASK)

#define NETC_IERB_CAPR0_NUM_SW_MASK              (0x30000U)
#define NETC_IERB_CAPR0_NUM_SW_SHIFT             (16U)
#define NETC_IERB_CAPR0_NUM_SW_WIDTH             (2U)
#define NETC_IERB_CAPR0_NUM_SW(x)                (((uint32_t)(((uint32_t)(x)) << NETC_IERB_CAPR0_NUM_SW_SHIFT)) & NETC_IERB_CAPR0_NUM_SW_MASK)

#define NETC_IERB_CAPR0_NUM_ENETC_MASK           (0xF80000U)
#define NETC_IERB_CAPR0_NUM_ENETC_SHIFT          (19U)
#define NETC_IERB_CAPR0_NUM_ENETC_WIDTH          (5U)
#define NETC_IERB_CAPR0_NUM_ENETC(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_CAPR0_NUM_ENETC_SHIFT)) & NETC_IERB_CAPR0_NUM_ENETC_MASK)

#define NETC_IERB_CAPR0_NUM_VSI_MASK             (0x7F000000U)
#define NETC_IERB_CAPR0_NUM_VSI_SHIFT            (24U)
#define NETC_IERB_CAPR0_NUM_VSI_WIDTH            (7U)
#define NETC_IERB_CAPR0_NUM_VSI(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_CAPR0_NUM_VSI_SHIFT)) & NETC_IERB_CAPR0_NUM_VSI_MASK)
/*! @} */

/*! @name CAPR1 - Capability Register 1 */
/*! @{ */

#define NETC_IERB_CAPR1_NUM_RX_BDR_MASK          (0x3FFU)
#define NETC_IERB_CAPR1_NUM_RX_BDR_SHIFT         (0U)
#define NETC_IERB_CAPR1_NUM_RX_BDR_WIDTH         (10U)
#define NETC_IERB_CAPR1_NUM_RX_BDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_CAPR1_NUM_RX_BDR_SHIFT)) & NETC_IERB_CAPR1_NUM_RX_BDR_MASK)

#define NETC_IERB_CAPR1_NUM_TX_BDR_MASK          (0x3FF0000U)
#define NETC_IERB_CAPR1_NUM_TX_BDR_SHIFT         (16U)
#define NETC_IERB_CAPR1_NUM_TX_BDR_WIDTH         (10U)
#define NETC_IERB_CAPR1_NUM_TX_BDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_CAPR1_NUM_TX_BDR_SHIFT)) & NETC_IERB_CAPR1_NUM_TX_BDR_MASK)
/*! @} */

