zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_IERB.h
/*! @name TFAUXR - Timer 0 function auxiliary register */
/*! @{ */

#define NETC_IERB_TFAUXR_FAUX_MASK               (0xFU)
#define NETC_IERB_TFAUXR_FAUX_SHIFT              (0U)
#define NETC_IERB_TFAUXR_FAUX_WIDTH              (4U)
#define NETC_IERB_TFAUXR_FAUX(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TFAUXR_FAUX_SHIFT)) & NETC_IERB_TFAUXR_FAUX_MASK)
/*! @} */

/*! @name TBLPR - Timer 0 boot loader parameter register 0..Timer 0 boot loader parameter register 1 */
/*! @{ */

#define NETC_IERB_TBLPR_PARAM_VAL_MASK           (0xFFFFFFFFU)
#define NETC_IERB_TBLPR_PARAM_VAL_SHIFT          (0U)
#define NETC_IERB_TBLPR_PARAM_VAL_WIDTH          (32U)
#define NETC_IERB_TBLPR_PARAM_VAL(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TBLPR_PARAM_VAL_SHIFT)) & NETC_IERB_TBLPR_PARAM_VAL_MASK)
/*! @} */

/*! @name TRIDAR - Timer 0 RID assignment register */
/*! @{ */

#define NETC_IERB_TRIDAR_RID_MASK                (0xFFFFU)
#define NETC_IERB_TRIDAR_RID_SHIFT               (0U)
#define NETC_IERB_TRIDAR_RID_WIDTH               (16U)
#define NETC_IERB_TRIDAR_RID(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TRIDAR_RID_SHIFT)) & NETC_IERB_TRIDAR_RID_MASK)

#define NETC_IERB_TRIDAR_PBUS_MASK               (0xFF0000U)
#define NETC_IERB_TRIDAR_PBUS_SHIFT              (16U)
#define NETC_IERB_TRIDAR_PBUS_WIDTH              (8U)
#define NETC_IERB_TRIDAR_PBUS(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TRIDAR_PBUS_SHIFT)) & NETC_IERB_TRIDAR_PBUS_MASK)
/*! @} */

/*! @name TM0MCR - Timer media channel 0 MSI-X configuration register */
/*! @{ */

#define NETC_IERB_TM0MCR_NUM_MSIX_MASK           (0x1U)
#define NETC_IERB_TM0MCR_NUM_MSIX_SHIFT          (0U)
#define NETC_IERB_TM0MCR_NUM_MSIX_WIDTH          (1U)
#define NETC_IERB_TM0MCR_NUM_MSIX(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TM0MCR_NUM_MSIX_SHIFT)) & NETC_IERB_TM0MCR_NUM_MSIX_MASK)
/*! @} */

/*! @name TM_CFH_DIDVID - Timer media channel config header device ID and vendor ID register */
/*! @{ */

#define NETC_IERB_TM_CFH_DIDVID_VENDOR_ID_MASK   (0xFFFFU)
#define NETC_IERB_TM_CFH_DIDVID_VENDOR_ID_SHIFT  (0U)
#define NETC_IERB_TM_CFH_DIDVID_VENDOR_ID_WIDTH  (16U)
#define NETC_IERB_TM_CFH_DIDVID_VENDOR_ID(x)     (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TM_CFH_DIDVID_VENDOR_ID_SHIFT)) & NETC_IERB_TM_CFH_DIDVID_VENDOR_ID_MASK)

#define NETC_IERB_TM_CFH_DIDVID_DEVICE_ID_MASK   (0xFFFF0000U)
#define NETC_IERB_TM_CFH_DIDVID_DEVICE_ID_SHIFT  (16U)
#define NETC_IERB_TM_CFH_DIDVID_DEVICE_ID_WIDTH  (16U)
#define NETC_IERB_TM_CFH_DIDVID_DEVICE_ID(x)     (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TM_CFH_DIDVID_DEVICE_ID_SHIFT)) & NETC_IERB_TM_CFH_DIDVID_DEVICE_ID_MASK)
/*! @} */

/*! @name TM_CFH_SIDSVID - Timer media channel config header subsystem ID and subsystem vendor ID register */
/*! @{ */

#define NETC_IERB_TM_CFH_SIDSVID_SUBSYSTEM_VENDOR_ID_MASK (0xFFFFU)
#define NETC_IERB_TM_CFH_SIDSVID_SUBSYSTEM_VENDOR_ID_SHIFT (0U)
#define NETC_IERB_TM_CFH_SIDSVID_SUBSYSTEM_VENDOR_ID_WIDTH (16U)
#define NETC_IERB_TM_CFH_SIDSVID_SUBSYSTEM_VENDOR_ID(x) (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TM_CFH_SIDSVID_SUBSYSTEM_VENDOR_ID_SHIFT)) & NETC_IERB_TM_CFH_SIDSVID_SUBSYSTEM_VENDOR_ID_MASK)

#define NETC_IERB_TM_CFH_SIDSVID_SUBSYSTEM_DEVICE_ID_MASK (0xFFFF0000U)
#define NETC_IERB_TM_CFH_SIDSVID_SUBSYSTEM_DEVICE_ID_SHIFT (16U)
#define NETC_IERB_TM_CFH_SIDSVID_SUBSYSTEM_DEVICE_ID_WIDTH (16U)
#define NETC_IERB_TM_CFH_SIDSVID_SUBSYSTEM_DEVICE_ID(x) (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TM_CFH_SIDSVID_SUBSYSTEM_DEVICE_ID_SHIFT)) & NETC_IERB_TM_CFH_SIDSVID_SUBSYSTEM_DEVICE_ID_MASK)
/*! @} */

/*! @name TM0CAR - Timer media channel 0 cache attribute register */
/*! @{ */

#define NETC_IERB_TM0CAR_WRCACHE_MASK            (0xFU)
#define NETC_IERB_TM0CAR_WRCACHE_SHIFT           (0U)
#define NETC_IERB_TM0CAR_WRCACHE_WIDTH           (4U)
#define NETC_IERB_TM0CAR_WRCACHE(x)              (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TM0CAR_WRCACHE_SHIFT)) & NETC_IERB_TM0CAR_WRCACHE_MASK)

#define NETC_IERB_TM0CAR_WRDOMAIN_MASK           (0x30U)
#define NETC_IERB_TM0CAR_WRDOMAIN_SHIFT          (4U)
#define NETC_IERB_TM0CAR_WRDOMAIN_WIDTH          (2U)
#define NETC_IERB_TM0CAR_WRDOMAIN(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TM0CAR_WRDOMAIN_SHIFT)) & NETC_IERB_TM0CAR_WRDOMAIN_MASK)

#define NETC_IERB_TM0CAR_WRSNP_MASK              (0xC0U)
#define NETC_IERB_TM0CAR_WRSNP_SHIFT             (6U)
#define NETC_IERB_TM0CAR_WRSNP_WIDTH             (2U)
#define NETC_IERB_TM0CAR_WRSNP(x)                (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TM0CAR_WRSNP_SHIFT)) & NETC_IERB_TM0CAR_WRSNP_MASK)

#define NETC_IERB_TM0CAR_RDCACHE_MASK            (0xF0000U)
#define NETC_IERB_TM0CAR_RDCACHE_SHIFT           (16U)
#define NETC_IERB_TM0CAR_RDCACHE_WIDTH           (4U)
#define NETC_IERB_TM0CAR_RDCACHE(x)              (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TM0CAR_RDCACHE_SHIFT)) & NETC_IERB_TM0CAR_RDCACHE_MASK)

#define NETC_IERB_TM0CAR_RDDOMAIN_MASK           (0x300000U)
#define NETC_IERB_TM0CAR_RDDOMAIN_SHIFT          (20U)
#define NETC_IERB_TM0CAR_RDDOMAIN_WIDTH          (2U)
#define NETC_IERB_TM0CAR_RDDOMAIN(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TM0CAR_RDDOMAIN_SHIFT)) & NETC_IERB_TM0CAR_RDDOMAIN_MASK)

#define NETC_IERB_TM0CAR_RDSNP_MASK              (0xC00000U)
#define NETC_IERB_TM0CAR_RDSNP_SHIFT             (22U)
#define NETC_IERB_TM0CAR_RDSNP_WIDTH             (2U)
#define NETC_IERB_TM0CAR_RDSNP(x)                (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TM0CAR_RDSNP_SHIFT)) & NETC_IERB_TM0CAR_RDSNP_MASK)
/*! @} */

/*! @name TM0AMQR - Timer media channel 0 access management qualifier register */
/*! @{ */

#define NETC_IERB_TM0AMQR_ARQOS_MASK             (0xF0000U)
#define NETC_IERB_TM0AMQR_ARQOS_SHIFT            (16U)
#define NETC_IERB_TM0AMQR_ARQOS_WIDTH            (4U)
#define NETC_IERB_TM0AMQR_ARQOS(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TM0AMQR_ARQOS_SHIFT)) & NETC_IERB_TM0AMQR_ARQOS_MASK)

#define NETC_IERB_TM0AMQR_AWQOS_MASK             (0xF00000U)
#define NETC_IERB_TM0AMQR_AWQOS_SHIFT            (20U)
#define NETC_IERB_TM0AMQR_AWQOS_WIDTH            (4U)
#define NETC_IERB_TM0AMQR_AWQOS(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TM0AMQR_AWQOS_SHIFT)) & NETC_IERB_TM0AMQR_AWQOS_MASK)
/*! @} */

