zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_IERB.h
/*! @name TM0FAUXR - Timer media channel 0 function auxiliary register */
/*! @{ */

#define NETC_IERB_TM0FAUXR_FAUX_MASK             (0xFU)
#define NETC_IERB_TM0FAUXR_FAUX_SHIFT            (0U)
#define NETC_IERB_TM0FAUXR_FAUX_WIDTH            (4U)
#define NETC_IERB_TM0FAUXR_FAUX(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TM0FAUXR_FAUX_SHIFT)) & NETC_IERB_TM0FAUXR_FAUX_MASK)
/*! @} */

/*! @name TM0RIDAR - Timer media channel 0 RID assignment register */
/*! @{ */

#define NETC_IERB_TM0RIDAR_RID_MASK              (0xFFFFU)
#define NETC_IERB_TM0RIDAR_RID_SHIFT             (0U)
#define NETC_IERB_TM0RIDAR_RID_WIDTH             (16U)
#define NETC_IERB_TM0RIDAR_RID(x)                (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TM0RIDAR_RID_SHIFT)) & NETC_IERB_TM0RIDAR_RID_MASK)

#define NETC_IERB_TM0RIDAR_PBUS_MASK             (0xFF0000U)
#define NETC_IERB_TM0RIDAR_PBUS_SHIFT            (16U)
#define NETC_IERB_TM0RIDAR_PBUS_WIDTH            (8U)
#define NETC_IERB_TM0RIDAR_PBUS(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TM0RIDAR_PBUS_SHIFT)) & NETC_IERB_TM0RIDAR_PBUS_MASK)
/*! @} */

/*! @name TGSMCAPR - Time gate scheduling memory capability register */
/*! @{ */

#define NETC_IERB_TGSMCAPR_NUM_MEM_MASK          (0xFU)
#define NETC_IERB_TGSMCAPR_NUM_MEM_SHIFT         (0U)
#define NETC_IERB_TGSMCAPR_NUM_MEM_WIDTH         (4U)
#define NETC_IERB_TGSMCAPR_NUM_MEM(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TGSMCAPR_NUM_MEM_SHIFT)) & NETC_IERB_TGSMCAPR_NUM_MEM_MASK)
/*! @} */

/*! @name TGSM0MAPR - Time gate scheduling memory 0 mapping register */
/*! @{ */

#define NETC_IERB_TGSM0MAPR_SWn_MASK             (0xFFFFU)
#define NETC_IERB_TGSM0MAPR_SWn_SHIFT            (0U)
#define NETC_IERB_TGSM0MAPR_SWn_WIDTH            (16U)
#define NETC_IERB_TGSM0MAPR_SWn(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TGSM0MAPR_SWn_SHIFT)) & NETC_IERB_TGSM0MAPR_SWn_MASK)

#define NETC_IERB_TGSM0MAPR_ENETCn_MASK          (0xFFFF0000U)
#define NETC_IERB_TGSM0MAPR_ENETCn_SHIFT         (16U)
#define NETC_IERB_TGSM0MAPR_ENETCn_WIDTH         (16U)
#define NETC_IERB_TGSM0MAPR_ENETCn(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TGSM0MAPR_ENETCn_SHIFT)) & NETC_IERB_TGSM0MAPR_ENETCn_MASK)
/*! @} */

/*! @name TGSM0CAPR - Time gate scheduling memory 0 capability register */
/*! @{ */

#define NETC_IERB_TGSM0CAPR_NUM_WORDS_MASK       (0xFFFFU)
#define NETC_IERB_TGSM0CAPR_NUM_WORDS_SHIFT      (0U)
#define NETC_IERB_TGSM0CAPR_NUM_WORDS_WIDTH      (16U)
#define NETC_IERB_TGSM0CAPR_NUM_WORDS(x)         (((uint32_t)(((uint32_t)(x)) << NETC_IERB_TGSM0CAPR_NUM_WORDS_SHIFT)) & NETC_IERB_TGSM0CAPR_NUM_WORDS_MASK)
/*! @} */

/*! @name GM0ATCAPR - Gate manager 0 advance time capability register */
/*! @{ */

#define NETC_IERB_GM0ATCAPR_ADVANCE_TIME_MASK    (0xFFFU)
#define NETC_IERB_GM0ATCAPR_ADVANCE_TIME_SHIFT   (0U)
#define NETC_IERB_GM0ATCAPR_ADVANCE_TIME_WIDTH   (12U)
#define NETC_IERB_GM0ATCAPR_ADVANCE_TIME(x)      (((uint32_t)(((uint32_t)(x)) << NETC_IERB_GM0ATCAPR_ADVANCE_TIME_SHIFT)) & NETC_IERB_GM0ATCAPR_ADVANCE_TIME_MASK)
/*! @} */

/*! @name L0CAPR - Link 0 capability register */
/*! @{ */

#define NETC_IERB_L0CAPR_LINK_TYPE_MASK          (0x10U)
#define NETC_IERB_L0CAPR_LINK_TYPE_SHIFT         (4U)
#define NETC_IERB_L0CAPR_LINK_TYPE_WIDTH         (1U)
#define NETC_IERB_L0CAPR_LINK_TYPE(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L0CAPR_LINK_TYPE_SHIFT)) & NETC_IERB_L0CAPR_LINK_TYPE_MASK)

#define NETC_IERB_L0CAPR_NUM_TC_MASK             (0xF000U)
#define NETC_IERB_L0CAPR_NUM_TC_SHIFT            (12U)
#define NETC_IERB_L0CAPR_NUM_TC_WIDTH            (4U)
#define NETC_IERB_L0CAPR_NUM_TC(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L0CAPR_NUM_TC_SHIFT)) & NETC_IERB_L0CAPR_NUM_TC_MASK)

#define NETC_IERB_L0CAPR_NUM_Q_MASK              (0xF0000U)
#define NETC_IERB_L0CAPR_NUM_Q_SHIFT             (16U)
#define NETC_IERB_L0CAPR_NUM_Q_WIDTH             (4U)
#define NETC_IERB_L0CAPR_NUM_Q(x)                (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L0CAPR_NUM_Q_SHIFT)) & NETC_IERB_L0CAPR_NUM_Q_MASK)

#define NETC_IERB_L0CAPR_NUM_CG_MASK             (0xF000000U)
#define NETC_IERB_L0CAPR_NUM_CG_SHIFT            (24U)
#define NETC_IERB_L0CAPR_NUM_CG_WIDTH            (4U)
#define NETC_IERB_L0CAPR_NUM_CG(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L0CAPR_NUM_CG_SHIFT)) & NETC_IERB_L0CAPR_NUM_CG_MASK)

#define NETC_IERB_L0CAPR_TGS_MASK                (0x10000000U)
#define NETC_IERB_L0CAPR_TGS_SHIFT               (28U)
#define NETC_IERB_L0CAPR_TGS_WIDTH               (1U)
#define NETC_IERB_L0CAPR_TGS(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L0CAPR_TGS_SHIFT)) & NETC_IERB_L0CAPR_TGS_MASK)

#define NETC_IERB_L0CAPR_CBS_MASK                (0x20000000U)
#define NETC_IERB_L0CAPR_CBS_SHIFT               (29U)
#define NETC_IERB_L0CAPR_CBS_WIDTH               (1U)
#define NETC_IERB_L0CAPR_CBS(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L0CAPR_CBS_SHIFT)) & NETC_IERB_L0CAPR_CBS_MASK)

#define NETC_IERB_L0CAPR_ECBS_MASK               (0x40000000U)
#define NETC_IERB_L0CAPR_ECBS_SHIFT              (30U)
#define NETC_IERB_L0CAPR_ECBS_WIDTH              (1U)
#define NETC_IERB_L0CAPR_ECBS(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L0CAPR_ECBS_SHIFT)) & NETC_IERB_L0CAPR_ECBS_MASK)

#define NETC_IERB_L0CAPR_ATS_MASK                (0x80000000U)
#define NETC_IERB_L0CAPR_ATS_SHIFT               (31U)
#define NETC_IERB_L0CAPR_ATS_WIDTH               (1U)
#define NETC_IERB_L0CAPR_ATS(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L0CAPR_ATS_SHIFT)) & NETC_IERB_L0CAPR_ATS_MASK)
/*! @} */

/*! @name L0MCAPR - Link 0 MAC capability register */
/*! @{ */

#define NETC_IERB_L0MCAPR_MAC_VAR_MASK           (0x7U)
#define NETC_IERB_L0MCAPR_MAC_VAR_SHIFT          (0U)
#define NETC_IERB_L0MCAPR_MAC_VAR_WIDTH          (3U)
#define NETC_IERB_L0MCAPR_MAC_VAR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L0MCAPR_MAC_VAR_SHIFT)) & NETC_IERB_L0MCAPR_MAC_VAR_MASK)

#define NETC_IERB_L0MCAPR_EFPAD_MASK             (0x30U)
#define NETC_IERB_L0MCAPR_EFPAD_SHIFT            (4U)
#define NETC_IERB_L0MCAPR_EFPAD_WIDTH            (2U)
#define NETC_IERB_L0MCAPR_EFPAD(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L0MCAPR_EFPAD_SHIFT)) & NETC_IERB_L0MCAPR_EFPAD_MASK)

