zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_IERB.h
#define NETC_IERB_L4CAPR_LINK_TYPE_MASK          (0x10U)
#define NETC_IERB_L4CAPR_LINK_TYPE_SHIFT         (4U)
#define NETC_IERB_L4CAPR_LINK_TYPE_WIDTH         (1U)
#define NETC_IERB_L4CAPR_LINK_TYPE(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4CAPR_LINK_TYPE_SHIFT)) & NETC_IERB_L4CAPR_LINK_TYPE_MASK)

#define NETC_IERB_L4CAPR_NUM_TC_MASK             (0xF000U)
#define NETC_IERB_L4CAPR_NUM_TC_SHIFT            (12U)
#define NETC_IERB_L4CAPR_NUM_TC_WIDTH            (4U)
#define NETC_IERB_L4CAPR_NUM_TC(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4CAPR_NUM_TC_SHIFT)) & NETC_IERB_L4CAPR_NUM_TC_MASK)

#define NETC_IERB_L4CAPR_NUM_Q_MASK              (0xF0000U)
#define NETC_IERB_L4CAPR_NUM_Q_SHIFT             (16U)
#define NETC_IERB_L4CAPR_NUM_Q_WIDTH             (4U)
#define NETC_IERB_L4CAPR_NUM_Q(x)                (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4CAPR_NUM_Q_SHIFT)) & NETC_IERB_L4CAPR_NUM_Q_MASK)

#define NETC_IERB_L4CAPR_NUM_CG_MASK             (0xF000000U)
#define NETC_IERB_L4CAPR_NUM_CG_SHIFT            (24U)
#define NETC_IERB_L4CAPR_NUM_CG_WIDTH            (4U)
#define NETC_IERB_L4CAPR_NUM_CG(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4CAPR_NUM_CG_SHIFT)) & NETC_IERB_L4CAPR_NUM_CG_MASK)

#define NETC_IERB_L4CAPR_TGS_MASK                (0x10000000U)
#define NETC_IERB_L4CAPR_TGS_SHIFT               (28U)
#define NETC_IERB_L4CAPR_TGS_WIDTH               (1U)
#define NETC_IERB_L4CAPR_TGS(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4CAPR_TGS_SHIFT)) & NETC_IERB_L4CAPR_TGS_MASK)

#define NETC_IERB_L4CAPR_CBS_MASK                (0x20000000U)
#define NETC_IERB_L4CAPR_CBS_SHIFT               (29U)
#define NETC_IERB_L4CAPR_CBS_WIDTH               (1U)
#define NETC_IERB_L4CAPR_CBS(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4CAPR_CBS_SHIFT)) & NETC_IERB_L4CAPR_CBS_MASK)

#define NETC_IERB_L4CAPR_ECBS_MASK               (0x40000000U)
#define NETC_IERB_L4CAPR_ECBS_SHIFT              (30U)
#define NETC_IERB_L4CAPR_ECBS_WIDTH              (1U)
#define NETC_IERB_L4CAPR_ECBS(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4CAPR_ECBS_SHIFT)) & NETC_IERB_L4CAPR_ECBS_MASK)

#define NETC_IERB_L4CAPR_ATS_MASK                (0x80000000U)
#define NETC_IERB_L4CAPR_ATS_SHIFT               (31U)
#define NETC_IERB_L4CAPR_ATS_WIDTH               (1U)
#define NETC_IERB_L4CAPR_ATS(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4CAPR_ATS_SHIFT)) & NETC_IERB_L4CAPR_ATS_MASK)
/*! @} */

/*! @name L4MCAPR - Link 4 MAC capability register */
/*! @{ */

#define NETC_IERB_L4MCAPR_MAC_VAR_MASK           (0x7U)
#define NETC_IERB_L4MCAPR_MAC_VAR_SHIFT          (0U)
#define NETC_IERB_L4MCAPR_MAC_VAR_WIDTH          (3U)
#define NETC_IERB_L4MCAPR_MAC_VAR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4MCAPR_MAC_VAR_SHIFT)) & NETC_IERB_L4MCAPR_MAC_VAR_MASK)

#define NETC_IERB_L4MCAPR_EFPAD_MASK             (0x30U)
#define NETC_IERB_L4MCAPR_EFPAD_SHIFT            (4U)
#define NETC_IERB_L4MCAPR_EFPAD_WIDTH            (2U)
#define NETC_IERB_L4MCAPR_EFPAD(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4MCAPR_EFPAD_SHIFT)) & NETC_IERB_L4MCAPR_EFPAD_MASK)

#define NETC_IERB_L4MCAPR_PIPG_MASK              (0x40U)
#define NETC_IERB_L4MCAPR_PIPG_SHIFT             (6U)
#define NETC_IERB_L4MCAPR_PIPG_WIDTH             (1U)
#define NETC_IERB_L4MCAPR_PIPG(x)                (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4MCAPR_PIPG_SHIFT)) & NETC_IERB_L4MCAPR_PIPG_MASK)

#define NETC_IERB_L4MCAPR_HD_MASK                (0x100U)
#define NETC_IERB_L4MCAPR_HD_SHIFT               (8U)
#define NETC_IERB_L4MCAPR_HD_WIDTH               (1U)
#define NETC_IERB_L4MCAPR_HD(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4MCAPR_HD_SHIFT)) & NETC_IERB_L4MCAPR_HD_MASK)

#define NETC_IERB_L4MCAPR_FP_MASK                (0x600U)
#define NETC_IERB_L4MCAPR_FP_SHIFT               (9U)
#define NETC_IERB_L4MCAPR_FP_WIDTH               (2U)
#define NETC_IERB_L4MCAPR_FP(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4MCAPR_FP_SHIFT)) & NETC_IERB_L4MCAPR_FP_MASK)

#define NETC_IERB_L4MCAPR_MIN_MPDU_MASK          (0x1000U)
#define NETC_IERB_L4MCAPR_MIN_MPDU_SHIFT         (12U)
#define NETC_IERB_L4MCAPR_MIN_MPDU_WIDTH         (1U)
#define NETC_IERB_L4MCAPR_MIN_MPDU(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4MCAPR_MIN_MPDU_SHIFT)) & NETC_IERB_L4MCAPR_MIN_MPDU_MASK)

#define NETC_IERB_L4MCAPR_MSEC_MASK              (0x2000U)
#define NETC_IERB_L4MCAPR_MSEC_SHIFT             (13U)
#define NETC_IERB_L4MCAPR_MSEC_WIDTH             (1U)
#define NETC_IERB_L4MCAPR_MSEC(x)                (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4MCAPR_MSEC_SHIFT)) & NETC_IERB_L4MCAPR_MSEC_MASK)

#define NETC_IERB_L4MCAPR_RGMII_DLY_MODE_CAP_MASK (0x300000U)
#define NETC_IERB_L4MCAPR_RGMII_DLY_MODE_CAP_SHIFT (20U)
#define NETC_IERB_L4MCAPR_RGMII_DLY_MODE_CAP_WIDTH (2U)
#define NETC_IERB_L4MCAPR_RGMII_DLY_MODE_CAP(x)  (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4MCAPR_RGMII_DLY_MODE_CAP_SHIFT)) & NETC_IERB_L4MCAPR_RGMII_DLY_MODE_CAP_MASK)

#define NETC_IERB_L4MCAPR_MII_PROT_MASK          (0xF000000U)
#define NETC_IERB_L4MCAPR_MII_PROT_SHIFT         (24U)
#define NETC_IERB_L4MCAPR_MII_PROT_WIDTH         (4U)
#define NETC_IERB_L4MCAPR_MII_PROT(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4MCAPR_MII_PROT_SHIFT)) & NETC_IERB_L4MCAPR_MII_PROT_MASK)
/*! @} */

/*! @name L4IOCAPR - Link 4 I/O capability register */
/*! @{ */

#define NETC_IERB_L4IOCAPR_PCS_PROT_MASK         (0xFFFFU)
#define NETC_IERB_L4IOCAPR_PCS_PROT_SHIFT        (0U)
#define NETC_IERB_L4IOCAPR_PCS_PROT_WIDTH        (16U)
#define NETC_IERB_L4IOCAPR_PCS_PROT(x)           (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4IOCAPR_PCS_PROT_SHIFT)) & NETC_IERB_L4IOCAPR_PCS_PROT_MASK)

#define NETC_IERB_L4IOCAPR_IO_VAR_MASK           (0xF000000U)
#define NETC_IERB_L4IOCAPR_IO_VAR_SHIFT          (24U)
#define NETC_IERB_L4IOCAPR_IO_VAR_WIDTH          (4U)
#define NETC_IERB_L4IOCAPR_IO_VAR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4IOCAPR_IO_VAR_SHIFT)) & NETC_IERB_L4IOCAPR_IO_VAR_MASK)

