zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_IERB.h
#define NETC_IERB_L5MCAPR_PIPG_MASK              (0x40U)
#define NETC_IERB_L5MCAPR_PIPG_SHIFT             (6U)
#define NETC_IERB_L5MCAPR_PIPG_WIDTH             (1U)
#define NETC_IERB_L5MCAPR_PIPG(x)                (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L5MCAPR_PIPG_SHIFT)) & NETC_IERB_L5MCAPR_PIPG_MASK)

#define NETC_IERB_L5MCAPR_HD_MASK                (0x100U)
#define NETC_IERB_L5MCAPR_HD_SHIFT               (8U)
#define NETC_IERB_L5MCAPR_HD_WIDTH               (1U)
#define NETC_IERB_L5MCAPR_HD(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L5MCAPR_HD_SHIFT)) & NETC_IERB_L5MCAPR_HD_MASK)

#define NETC_IERB_L5MCAPR_FP_MASK                (0x600U)
#define NETC_IERB_L5MCAPR_FP_SHIFT               (9U)
#define NETC_IERB_L5MCAPR_FP_WIDTH               (2U)
#define NETC_IERB_L5MCAPR_FP(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L5MCAPR_FP_SHIFT)) & NETC_IERB_L5MCAPR_FP_MASK)

#define NETC_IERB_L5MCAPR_MIN_MPDU_MASK          (0x1000U)
#define NETC_IERB_L5MCAPR_MIN_MPDU_SHIFT         (12U)
#define NETC_IERB_L5MCAPR_MIN_MPDU_WIDTH         (1U)
#define NETC_IERB_L5MCAPR_MIN_MPDU(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L5MCAPR_MIN_MPDU_SHIFT)) & NETC_IERB_L5MCAPR_MIN_MPDU_MASK)

#define NETC_IERB_L5MCAPR_MSEC_MASK              (0x2000U)
#define NETC_IERB_L5MCAPR_MSEC_SHIFT             (13U)
#define NETC_IERB_L5MCAPR_MSEC_WIDTH             (1U)
#define NETC_IERB_L5MCAPR_MSEC(x)                (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L5MCAPR_MSEC_SHIFT)) & NETC_IERB_L5MCAPR_MSEC_MASK)

#define NETC_IERB_L5MCAPR_RGMII_DLY_MODE_CAP_MASK (0x300000U)
#define NETC_IERB_L5MCAPR_RGMII_DLY_MODE_CAP_SHIFT (20U)
#define NETC_IERB_L5MCAPR_RGMII_DLY_MODE_CAP_WIDTH (2U)
#define NETC_IERB_L5MCAPR_RGMII_DLY_MODE_CAP(x)  (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L5MCAPR_RGMII_DLY_MODE_CAP_SHIFT)) & NETC_IERB_L5MCAPR_RGMII_DLY_MODE_CAP_MASK)

#define NETC_IERB_L5MCAPR_MII_PROT_MASK          (0xF000000U)
#define NETC_IERB_L5MCAPR_MII_PROT_SHIFT         (24U)
#define NETC_IERB_L5MCAPR_MII_PROT_WIDTH         (4U)
#define NETC_IERB_L5MCAPR_MII_PROT(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L5MCAPR_MII_PROT_SHIFT)) & NETC_IERB_L5MCAPR_MII_PROT_MASK)
/*! @} */

/*! @name L5BCR - Link 5 binding configuration register */
/*! @{ */

#define NETC_IERB_L5BCR_SW_PORT_ENETC_INST_MASK  (0x1FU)
#define NETC_IERB_L5BCR_SW_PORT_ENETC_INST_SHIFT (0U)
#define NETC_IERB_L5BCR_SW_PORT_ENETC_INST_WIDTH (5U)
#define NETC_IERB_L5BCR_SW_PORT_ENETC_INST(x)    (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L5BCR_SW_PORT_ENETC_INST_SHIFT)) & NETC_IERB_L5BCR_SW_PORT_ENETC_INST_MASK)

#define NETC_IERB_L5BCR_NETC_FUNC_MASK           (0x40U)
#define NETC_IERB_L5BCR_NETC_FUNC_SHIFT          (6U)
#define NETC_IERB_L5BCR_NETC_FUNC_WIDTH          (1U)
#define NETC_IERB_L5BCR_NETC_FUNC(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L5BCR_NETC_FUNC_SHIFT)) & NETC_IERB_L5BCR_NETC_FUNC_MASK)

#define NETC_IERB_L5BCR_SPL_SW_PORT_MASK         (0x1F0000U)
#define NETC_IERB_L5BCR_SPL_SW_PORT_SHIFT        (16U)
#define NETC_IERB_L5BCR_SPL_SW_PORT_WIDTH        (5U)
#define NETC_IERB_L5BCR_SPL_SW_PORT(x)           (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L5BCR_SPL_SW_PORT_SHIFT)) & NETC_IERB_L5BCR_SPL_SW_PORT_MASK)
/*! @} */

/*! @name L5TXBCCTR - Link 5 transmit byte credit comfort threshold register */
/*! @{ */

#define NETC_IERB_L5TXBCCTR_THRESH_MASK          (0xFFFFU)
#define NETC_IERB_L5TXBCCTR_THRESH_SHIFT         (0U)
#define NETC_IERB_L5TXBCCTR_THRESH_WIDTH         (16U)
#define NETC_IERB_L5TXBCCTR_THRESH(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L5TXBCCTR_THRESH_SHIFT)) & NETC_IERB_L5TXBCCTR_THRESH_MASK)
/*! @} */

/*! @name L5E0MAR0 - Link 5 end 0 MAC address register 0 */
/*! @{ */

#define NETC_IERB_L5E0MAR0_MAC_ADDR_MASK         (0xFFFFFFFFU)
#define NETC_IERB_L5E0MAR0_MAC_ADDR_SHIFT        (0U)
#define NETC_IERB_L5E0MAR0_MAC_ADDR_WIDTH        (32U)
#define NETC_IERB_L5E0MAR0_MAC_ADDR(x)           (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L5E0MAR0_MAC_ADDR_SHIFT)) & NETC_IERB_L5E0MAR0_MAC_ADDR_MASK)
/*! @} */

/*! @name L5E0MAR1 - Link 5 end 0 MAC address register 1 */
/*! @{ */

#define NETC_IERB_L5E0MAR1_MAC_ADDR_MASK         (0xFFFFU)
#define NETC_IERB_L5E0MAR1_MAC_ADDR_SHIFT        (0U)
#define NETC_IERB_L5E0MAR1_MAC_ADDR_WIDTH        (16U)
#define NETC_IERB_L5E0MAR1_MAC_ADDR(x)           (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L5E0MAR1_MAC_ADDR_SHIFT)) & NETC_IERB_L5E0MAR1_MAC_ADDR_MASK)
/*! @} */

/*! @name L5E1MAR0 - Link 5 end 1 MAC address register 0 */
/*! @{ */

#define NETC_IERB_L5E1MAR0_MAC_ADDR_MASK         (0xFFFFFFFFU)
#define NETC_IERB_L5E1MAR0_MAC_ADDR_SHIFT        (0U)
#define NETC_IERB_L5E1MAR0_MAC_ADDR_WIDTH        (32U)
#define NETC_IERB_L5E1MAR0_MAC_ADDR(x)           (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L5E1MAR0_MAC_ADDR_SHIFT)) & NETC_IERB_L5E1MAR0_MAC_ADDR_MASK)
/*! @} */

/*! @name L5E1MAR1 - Link 5 end 1 MAC address register 1 */
/*! @{ */

#define NETC_IERB_L5E1MAR1_MAC_ADDR_MASK         (0xFFFFU)
#define NETC_IERB_L5E1MAR1_MAC_ADDR_SHIFT        (0U)
#define NETC_IERB_L5E1MAR1_MAC_ADDR_WIDTH        (16U)
#define NETC_IERB_L5E1MAR1_MAC_ADDR(x)           (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L5E1MAR1_MAC_ADDR_SHIFT)) & NETC_IERB_L5E1MAR1_MAC_ADDR_MASK)
/*! @} */

/*! @name SMCR - Switch 0 MSI-X configuration register */
/*! @{ */

#define NETC_IERB_SMCR_NUM_MSIX_MASK             (0xFU)
#define NETC_IERB_SMCR_NUM_MSIX_SHIFT            (0U)
#define NETC_IERB_SMCR_NUM_MSIX_WIDTH            (4U)
#define NETC_IERB_SMCR_NUM_MSIX(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SMCR_NUM_MSIX_SHIFT)) & NETC_IERB_SMCR_NUM_MSIX_MASK)
/*! @} */

/*! @name SEVMCR - Switch 0 event monitor configuration register */
/*! @{ */

#define NETC_IERB_SEVMCR_NUM_EVM_MASK            (0x3FU)
#define NETC_IERB_SEVMCR_NUM_EVM_SHIFT           (0U)
#define NETC_IERB_SEVMCR_NUM_EVM_WIDTH           (6U)
#define NETC_IERB_SEVMCR_NUM_EVM(x)              (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SEVMCR_NUM_EVM_SHIFT)) & NETC_IERB_SEVMCR_NUM_EVM_MASK)
/*! @} */

/*! @name S_CFH_DIDVID - Switch 0 config header device ID and vendor ID register */
/*! @{ */

#define NETC_IERB_S_CFH_DIDVID_VENDOR_ID_MASK    (0xFFFFU)
#define NETC_IERB_S_CFH_DIDVID_VENDOR_ID_SHIFT   (0U)
#define NETC_IERB_S_CFH_DIDVID_VENDOR_ID_WIDTH   (16U)
#define NETC_IERB_S_CFH_DIDVID_VENDOR_ID(x)      (((uint32_t)(((uint32_t)(x)) << NETC_IERB_S_CFH_DIDVID_VENDOR_ID_SHIFT)) & NETC_IERB_S_CFH_DIDVID_VENDOR_ID_MASK)

#define NETC_IERB_S_CFH_DIDVID_DEVICE_ID_MASK    (0xFFFF0000U)
#define NETC_IERB_S_CFH_DIDVID_DEVICE_ID_SHIFT   (16U)
#define NETC_IERB_S_CFH_DIDVID_DEVICE_ID_WIDTH   (16U)
#define NETC_IERB_S_CFH_DIDVID_DEVICE_ID(x)      (((uint32_t)(((uint32_t)(x)) << NETC_IERB_S_CFH_DIDVID_DEVICE_ID_SHIFT)) & NETC_IERB_S_CFH_DIDVID_DEVICE_ID_MASK)
/*! @} */

/*! @name S_CFH_SIDSVID - Switch 0 config header subsystem ID and subsystem vendor ID register */
/*! @{ */

#define NETC_IERB_S_CFH_SIDSVID_SUBSYSTEM_VENDOR_ID_MASK (0xFFFFU)
#define NETC_IERB_S_CFH_SIDSVID_SUBSYSTEM_VENDOR_ID_SHIFT (0U)
#define NETC_IERB_S_CFH_SIDSVID_SUBSYSTEM_VENDOR_ID_WIDTH (16U)
#define NETC_IERB_S_CFH_SIDSVID_SUBSYSTEM_VENDOR_ID(x) (((uint32_t)(((uint32_t)(x)) << NETC_IERB_S_CFH_SIDSVID_SUBSYSTEM_VENDOR_ID_SHIFT)) & NETC_IERB_S_CFH_SIDSVID_SUBSYSTEM_VENDOR_ID_MASK)

#define NETC_IERB_S_CFH_SIDSVID_SUBSYSTEM_DEVICE_ID_MASK (0xFFFF0000U)
#define NETC_IERB_S_CFH_SIDSVID_SUBSYSTEM_DEVICE_ID_SHIFT (16U)
#define NETC_IERB_S_CFH_SIDSVID_SUBSYSTEM_DEVICE_ID_WIDTH (16U)
#define NETC_IERB_S_CFH_SIDSVID_SUBSYSTEM_DEVICE_ID(x) (((uint32_t)(((uint32_t)(x)) << NETC_IERB_S_CFH_SIDSVID_SUBSYSTEM_DEVICE_ID_SHIFT)) & NETC_IERB_S_CFH_SIDSVID_SUBSYSTEM_DEVICE_ID_MASK)
/*! @} */

/*! @name SCCAR - Switch 0 command cache attribute register */
/*! @{ */

#define NETC_IERB_SCCAR_CBD_WRCACHE_MASK         (0xFU)
#define NETC_IERB_SCCAR_CBD_WRCACHE_SHIFT        (0U)
#define NETC_IERB_SCCAR_CBD_WRCACHE_WIDTH        (4U)
#define NETC_IERB_SCCAR_CBD_WRCACHE(x)           (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SCCAR_CBD_WRCACHE_SHIFT)) & NETC_IERB_SCCAR_CBD_WRCACHE_MASK)

#define NETC_IERB_SCCAR_CBD_WRDOMAIN_MASK        (0x30U)
#define NETC_IERB_SCCAR_CBD_WRDOMAIN_SHIFT       (4U)
#define NETC_IERB_SCCAR_CBD_WRDOMAIN_WIDTH       (2U)
#define NETC_IERB_SCCAR_CBD_WRDOMAIN(x)          (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SCCAR_CBD_WRDOMAIN_SHIFT)) & NETC_IERB_SCCAR_CBD_WRDOMAIN_MASK)

#define NETC_IERB_SCCAR_CBD_WRSNP_MASK           (0xC0U)
#define NETC_IERB_SCCAR_CBD_WRSNP_SHIFT          (6U)
#define NETC_IERB_SCCAR_CBD_WRSNP_WIDTH          (2U)
#define NETC_IERB_SCCAR_CBD_WRSNP(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SCCAR_CBD_WRSNP_SHIFT)) & NETC_IERB_SCCAR_CBD_WRSNP_MASK)

#define NETC_IERB_SCCAR_CWRCACHE_MASK            (0xF00U)
#define NETC_IERB_SCCAR_CWRCACHE_SHIFT           (8U)
#define NETC_IERB_SCCAR_CWRCACHE_WIDTH           (4U)
#define NETC_IERB_SCCAR_CWRCACHE(x)              (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SCCAR_CWRCACHE_SHIFT)) & NETC_IERB_SCCAR_CWRCACHE_MASK)

#define NETC_IERB_SCCAR_CWRDOMAIN_MASK           (0x3000U)
#define NETC_IERB_SCCAR_CWRDOMAIN_SHIFT          (12U)
#define NETC_IERB_SCCAR_CWRDOMAIN_WIDTH          (2U)
#define NETC_IERB_SCCAR_CWRDOMAIN(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SCCAR_CWRDOMAIN_SHIFT)) & NETC_IERB_SCCAR_CWRDOMAIN_MASK)

#define NETC_IERB_SCCAR_CWRSNP_MASK              (0xC000U)
#define NETC_IERB_SCCAR_CWRSNP_SHIFT             (14U)
#define NETC_IERB_SCCAR_CWRSNP_WIDTH             (2U)
#define NETC_IERB_SCCAR_CWRSNP(x)                (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SCCAR_CWRSNP_SHIFT)) & NETC_IERB_SCCAR_CWRSNP_MASK)

#define NETC_IERB_SCCAR_CBD_RDCACHE_MASK         (0xF0000U)
#define NETC_IERB_SCCAR_CBD_RDCACHE_SHIFT        (16U)
#define NETC_IERB_SCCAR_CBD_RDCACHE_WIDTH        (4U)
#define NETC_IERB_SCCAR_CBD_RDCACHE(x)           (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SCCAR_CBD_RDCACHE_SHIFT)) & NETC_IERB_SCCAR_CBD_RDCACHE_MASK)

#define NETC_IERB_SCCAR_CBD_RDDOMAIN_MASK        (0x300000U)
#define NETC_IERB_SCCAR_CBD_RDDOMAIN_SHIFT       (20U)
#define NETC_IERB_SCCAR_CBD_RDDOMAIN_WIDTH       (2U)
#define NETC_IERB_SCCAR_CBD_RDDOMAIN(x)          (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SCCAR_CBD_RDDOMAIN_SHIFT)) & NETC_IERB_SCCAR_CBD_RDDOMAIN_MASK)

#define NETC_IERB_SCCAR_CBD_RDSNP_MASK           (0xC00000U)
#define NETC_IERB_SCCAR_CBD_RDSNP_SHIFT          (22U)
#define NETC_IERB_SCCAR_CBD_RDSNP_WIDTH          (2U)
#define NETC_IERB_SCCAR_CBD_RDSNP(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SCCAR_CBD_RDSNP_SHIFT)) & NETC_IERB_SCCAR_CBD_RDSNP_MASK)

