zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_IERB.h
#define NETC_IERB_SVFHTDECR1_FID_MASK            (0xFFFU)
#define NETC_IERB_SVFHTDECR1_FID_SHIFT           (0U)
#define NETC_IERB_SVFHTDECR1_FID_WIDTH           (12U)
#define NETC_IERB_SVFHTDECR1_FID(x)              (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR1_FID_SHIFT)) & NETC_IERB_SVFHTDECR1_FID_MASK)

#define NETC_IERB_SVFHTDECR1_VL_MODE_MASK        (0x1000U)
#define NETC_IERB_SVFHTDECR1_VL_MODE_SHIFT       (12U)
#define NETC_IERB_SVFHTDECR1_VL_MODE_WIDTH       (1U)
#define NETC_IERB_SVFHTDECR1_VL_MODE(x)          (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR1_VL_MODE_SHIFT)) & NETC_IERB_SVFHTDECR1_VL_MODE_MASK)

#define NETC_IERB_SVFHTDECR1_PGA_MASK            (0x2000U)
#define NETC_IERB_SVFHTDECR1_PGA_SHIFT           (13U)
#define NETC_IERB_SVFHTDECR1_PGA_WIDTH           (1U)
#define NETC_IERB_SVFHTDECR1_PGA(x)              (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR1_PGA_SHIFT)) & NETC_IERB_SVFHTDECR1_PGA_MASK)

#define NETC_IERB_SVFHTDECR1_ET_EID_MASK         (0xFFFF0000U)
#define NETC_IERB_SVFHTDECR1_ET_EID_SHIFT        (16U)
#define NETC_IERB_SVFHTDECR1_ET_EID_WIDTH        (16U)
#define NETC_IERB_SVFHTDECR1_ET_EID(x)           (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR1_ET_EID_SHIFT)) & NETC_IERB_SVFHTDECR1_ET_EID_MASK)
/*! @} */

/*! @name SVFHTDECR2 - Switch 0 VLAN filter hash table default entry configuration registers 2 */
/*! @{ */

#define NETC_IERB_SVFHTDECR2_ETA_PORT0_MASK      (0x1U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT0_SHIFT     (0U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT0_WIDTH     (1U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT0(x)        (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR2_ETA_PORT0_SHIFT)) & NETC_IERB_SVFHTDECR2_ETA_PORT0_MASK)

#define NETC_IERB_SVFHTDECR2_ETA_PORT1_MASK      (0x2U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT1_SHIFT     (1U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT1_WIDTH     (1U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT1(x)        (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR2_ETA_PORT1_SHIFT)) & NETC_IERB_SVFHTDECR2_ETA_PORT1_MASK)

#define NETC_IERB_SVFHTDECR2_ETA_PORT2_MASK      (0x4U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT2_SHIFT     (2U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT2_WIDTH     (1U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT2(x)        (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR2_ETA_PORT2_SHIFT)) & NETC_IERB_SVFHTDECR2_ETA_PORT2_MASK)

#define NETC_IERB_SVFHTDECR2_ETA_PORT3_MASK      (0x8U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT3_SHIFT     (3U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT3_WIDTH     (1U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT3(x)        (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR2_ETA_PORT3_SHIFT)) & NETC_IERB_SVFHTDECR2_ETA_PORT3_MASK)

#define NETC_IERB_SVFHTDECR2_ETA_PORT4_MASK      (0x10U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT4_SHIFT     (4U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT4_WIDTH     (1U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT4(x)        (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR2_ETA_PORT4_SHIFT)) & NETC_IERB_SVFHTDECR2_ETA_PORT4_MASK)

#define NETC_IERB_SVFHTDECR2_ETA_PORT5_MASK      (0x20U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT5_SHIFT     (5U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT5_WIDTH     (1U)
#define NETC_IERB_SVFHTDECR2_ETA_PORT5(x)        (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR2_ETA_PORT5_SHIFT)) & NETC_IERB_SVFHTDECR2_ETA_PORT5_MASK)

#define NETC_IERB_SVFHTDECR2_MLO_MASK            (0x7000000U)
#define NETC_IERB_SVFHTDECR2_MLO_SHIFT           (24U)
#define NETC_IERB_SVFHTDECR2_MLO_WIDTH           (3U)
#define NETC_IERB_SVFHTDECR2_MLO(x)              (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR2_MLO_SHIFT)) & NETC_IERB_SVFHTDECR2_MLO_MASK)

#define NETC_IERB_SVFHTDECR2_MFO_MASK            (0x18000000U)
#define NETC_IERB_SVFHTDECR2_MFO_SHIFT           (27U)
#define NETC_IERB_SVFHTDECR2_MFO_WIDTH           (2U)
#define NETC_IERB_SVFHTDECR2_MFO(x)              (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR2_MFO_SHIFT)) & NETC_IERB_SVFHTDECR2_MFO_MASK)

#define NETC_IERB_SVFHTDECR2_FDBAFSS_MASK        (0x20000000U)
#define NETC_IERB_SVFHTDECR2_FDBAFSS_SHIFT       (29U)
#define NETC_IERB_SVFHTDECR2_FDBAFSS_WIDTH       (1U)
#define NETC_IERB_SVFHTDECR2_FDBAFSS(x)          (((uint32_t)(((uint32_t)(x)) << NETC_IERB_SVFHTDECR2_FDBAFSS_SHIFT)) & NETC_IERB_SVFHTDECR2_FDBAFSS_MASK)
/*! @} */

/*! @name EBCR1 - ENETC 0 binding configuration register 1 */
/*! @{ */

#define NETC_IERB_EBCR1_NUM_RX_BDR_MASK          (0x3FFU)
#define NETC_IERB_EBCR1_NUM_RX_BDR_SHIFT         (0U)
#define NETC_IERB_EBCR1_NUM_RX_BDR_WIDTH         (10U)
#define NETC_IERB_EBCR1_NUM_RX_BDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_EBCR1_NUM_RX_BDR_SHIFT)) & NETC_IERB_EBCR1_NUM_RX_BDR_MASK)

#define NETC_IERB_EBCR1_NUM_TX_BDR_MASK          (0x3FF0000U)
#define NETC_IERB_EBCR1_NUM_TX_BDR_SHIFT         (16U)
#define NETC_IERB_EBCR1_NUM_TX_BDR_WIDTH         (10U)
#define NETC_IERB_EBCR1_NUM_TX_BDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_EBCR1_NUM_TX_BDR_SHIFT)) & NETC_IERB_EBCR1_NUM_TX_BDR_MASK)
/*! @} */

/*! @name EBCR2 - ENETC 0 binding configuration register 2 */
/*! @{ */

#define NETC_IERB_EBCR2_NUM_MAC_AFTE_MASK        (0xFFFU)
#define NETC_IERB_EBCR2_NUM_MAC_AFTE_SHIFT       (0U)
#define NETC_IERB_EBCR2_NUM_MAC_AFTE_WIDTH       (12U)
#define NETC_IERB_EBCR2_NUM_MAC_AFTE(x)          (((uint32_t)(((uint32_t)(x)) << NETC_IERB_EBCR2_NUM_MAC_AFTE_SHIFT)) & NETC_IERB_EBCR2_NUM_MAC_AFTE_MASK)

#define NETC_IERB_EBCR2_NUM_VLAN_FTE_MASK        (0xFFF0000U)
#define NETC_IERB_EBCR2_NUM_VLAN_FTE_SHIFT       (16U)
#define NETC_IERB_EBCR2_NUM_VLAN_FTE_WIDTH       (12U)
#define NETC_IERB_EBCR2_NUM_VLAN_FTE(x)          (((uint32_t)(((uint32_t)(x)) << NETC_IERB_EBCR2_NUM_VLAN_FTE_SHIFT)) & NETC_IERB_EBCR2_NUM_VLAN_FTE_MASK)
/*! @} */

/*! @name EVFRIDAR - ENETC 0 VF RID assignment register */
/*! @{ */

#define NETC_IERB_EVFRIDAR_NUM_VF_MASK           (0xFU)
#define NETC_IERB_EVFRIDAR_NUM_VF_SHIFT          (0U)
#define NETC_IERB_EVFRIDAR_NUM_VF_WIDTH          (4U)
#define NETC_IERB_EVFRIDAR_NUM_VF(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_EVFRIDAR_NUM_VF_SHIFT)) & NETC_IERB_EVFRIDAR_NUM_VF_MASK)

#define NETC_IERB_EVFRIDAR_STRIDE_MASK           (0x300U)
#define NETC_IERB_EVFRIDAR_STRIDE_SHIFT          (8U)
#define NETC_IERB_EVFRIDAR_STRIDE_WIDTH          (2U)
#define NETC_IERB_EVFRIDAR_STRIDE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_EVFRIDAR_STRIDE_SHIFT)) & NETC_IERB_EVFRIDAR_STRIDE_MASK)

